app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    user_params = params.permit(:first_name, :last_name, :description)
    @user = User.find(params[:id])