app/controllers/attendances_controller.rb

  def new
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def index
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @event = Event.find(params[:event_id])
    # Amount in cents
    @amount = @event.price

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Paiement du participant', #{@attendee.first_name} #{@attendee.last_name}
      :currency    => 'eur'
    )

    @attendance = Attendance.new(attendee_id: current_user.id, event_id: params[:event_id])
    #flash[:success] = "Vous participez à l'évènement"
    #redirect_to @event
    if @attendance.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attendances" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["attendee_id", 2], ["created_at", "2019-02-13 20:44:21.382706"], ["updated_at", "2019-02-13 20:44:21.382706"]]

  def only_user
    @event = Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]