app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "description" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Noé"], ["last_name", "Marguillard"], ["description", "Etudiant qui aime entreprendre"], ["updated_at", "2019-02-12 23:08:00.991555"], ["id", 1]]
---
  def update
    user_params = params.permit(:first_name, :last_name, :description)

      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def authenticate_user
      @user = User.find(params[:id])